app/controllers/admin/administrateurs_controller.rb

SELECT "admins".* FROM "admins"
---
  def index
    if !connected?
      return
    end
    @liste = Admin.all

SELECT  "admins".* FROM "admins" WHERE "admins"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    if !connected?
      return
    end
    @admin = Admin.find_by(id: current_admin_id)

SELECT  "admins".* FROM "admins" WHERE "admins"."username" = ? LIMIT ?  [["username", "iii"], ["LIMIT", 1]]
INSERT INTO "admins" ("username", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["username", "ooo"], ["password_digest", "ppp"], ["created_at", "2021-05-14 10:34:07.987383"], ["updated_at", "2021-05-14 10:34:07.987383"]]
---
  def create
    if !connected?
      return
    end
    @errors = []
    if params[:username].nil? || params[:username].empty? then
      @errors.push "Le nom d'utilisateur n'est pas renseigné"
    elsif !Admin.find_by(username: params[:username]).nil?
      @errors.push "Cet utilisateur existe déjà!"
    end

      session[:errors] = @errors
    if @errors.length > 0

      return
    end
    ###########################################################
    @admin = Admin.new(admin_params)

    if @admin.save

SELECT  "admins".* FROM "admins" WHERE "admins"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    if !connected?
      return
    end
    @admin = Admin.find_by(id: params[:id])

SELECT  "admins".* FROM "admins" WHERE "admins"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "admins" SET "password_digest" = ?, "updated_at" = ? WHERE "admins"."id" = ?  [["password_digest", "u"], ["updated_at", "2021-05-14 10:12:22.385194"], ["id", 1]]
SELECT  1 AS one FROM "admins" WHERE "admins"."username" = ? AND "admins"."id" != ? LIMIT ?  [["username", "zozo"], ["id", 1], ["LIMIT", 1]]
---
  def update
    if !connected?
      return
    end
    @admin = Admin.find_by(id: params[:id])
    @errors = []
    if @admin.nil?
      @errors.push "Compte d'admin inexistant"
    end
    if params[:username].nil? || params[:username].empty? then
      @errors.push "Le nom d'utilisateur n'est pas renseigné"
    else
      @other_admins = Admin.where(username: params[:username]).where.not(id: params[:id])
      if !@other_admins.nil? && !@other_admins.empty?
        @errors.push "Cet utilisateur existe déjà!"

SELECT "admins".* FROM "admins" WHERE "admins"."username" = ? AND "admins"."password_digest" = ?  [["username", "iii"], ["password_digest", "ppp"]]
---
  def connect_access
    @errors = []
    @other_admin = Admin.where(username: params[:username])
                        .where(password_digest: params[:password_digest])
    puts(@other_admin)
    if @other_admin.nil? || @other_admin.empty?

SELECT  "admins".* FROM "admins" WHERE "admins"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "admins" WHERE "admins"."id" = ?  [["id", 1]]
---
  def destroy
    @admin = Admin.find_by(id: params[:id])
    @admin.destroy