app/controllers/admin/dashboards_controller.rb

	def dashboard
		init_dashboard

		session[:dashboard].each do |key_0, stat|
			bool = false
			data = {}
			filtre = {}
			stat["filtre"].each do |key_1, val|
				if params.has_key? key_0
					filtre[key_1] = params[key_0][key_1]
					bool = true
				end
			end

			data["filtre"] = bool ? filtre : stat["filtre"]
			data["donnees"] = nil
			data["actif"] = params.has_key?(key_0) &&
			params[key_0].has_key?("actif") ?
			(params[key_0]["actif"].to_i > 0) : stat["actif"]


			if !stat["actif"]
				next
			end

			case key_0
			when "nombre_de_prets"
				obj = Demande.nombre_demandes(filtre)
				d = []
				obj.each do |item|
---
SELECT Demandes.status, COUNT(*) as nombre FROM "demandes" WHERE (Demandes.created_at >= '2021-06-11') AND (Demandes.created_at <= '2021-06-05') GROUP BY Demandes.status ORDER BY Demandes.status