app/controllers/admin/emprunteurs_controller.rb

SELECT  "utilisateurs".* FROM "utilisateurs" WHERE "utilisateurs"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
---
    def info
        @user = Utilisateur.find_by(id: params[:id])

SELECT  "utilisateurs".* FROM "utilisateurs" WHERE "utilisateurs"."id" = ? LIMIT ?  [["id", 17], ["LIMIT", 1]]
UPDATE "utilisateurs" SET "status" = ?, "updated_at" = ? WHERE "utilisateurs"."id" = ?  [["status", "2"], ["updated_at", "2021-06-12 15:42:24.266027"], ["id", 17]]
SELECT "demandes".* FROM "demandes" WHERE "demandes"."utilisateur_id" = ?  [["utilisateur_id", 17]]
UPDATE "demandes" SET "date_accepted" = ?, "status" = ?, "updated_at" = ? WHERE "demandes"."id" = ?  [["date_accepted", "2021-06-25 12:57:56.081872"], ["status", "19"], ["updated_at", "2021-06-25 12:57:56.335590"], ["id", 8]]
---
    def validation (id, new_status)
        @user = Utilisateur.find_by(id: id)
        if @user.nil?
            errors = []; errors.push "Compte d'emprunteur inconnu"
            session[:errors] = errors
            redirect_to "/admin/liste_en_attente_emp"
            return
        end
        if @user.status.to_i == Utilisateur.status_active
            errors = []; errors.push "Compte d'emprunteur déjà activé"
            session[:errors] = errors
            redirect_to "/admin/liste_en_attente_emp"
            return
        end
        @user.status = new_status
        @user.save
        if new_status == Utilisateur.status_active
            #valider toutes les demandes en attente
            lst = Demande.where(:utilisateur_id => id)
            lst.each do |dmd|
                Demande.update(dmd.id,
                    "date_accepted" => @user.updated_at,
                    "status" => (dmd.status.to_i | 2**Demande.cond_status_compte)
                )