app/controllers/listes_controller.rb

SELECT  "otps".* FROM "otps" WHERE "otps"."num_phone" = ? LIMIT ?  [["num_phone", "91608089"], ["LIMIT", 1]]
INSERT INTO "otps" ("num_phone", "code", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["num_phone", "91608089"], ["code", "376226"], ["created_at", "2021-05-07 18:16:44.590735"], ["updated_at", "2021-05-07 18:16:44.590735"]]
UPDATE "otps" SET "code" = ?, "updated_at" = ? WHERE "otps"."id" = ?  [["code", "125447"], ["updated_at", "2021-05-07 18:16:55.843766"], ["id", 8]]
SELECT  "otps".* FROM "otps" WHERE "otps"."num_phone" = ? AND "otps"."code" = ? LIMIT ?  [["num_phone", "91608089"], ["code", "331958"], ["LIMIT", 1]]
---
  def histopretsaccordes
    prm = params.permit(:phone, :code);
    @num_phone = params[:phone]
    @code = params[:code]
    @error = ""
    @liste = []
    @liste_affiche = false

    @otp = nil



    if @num_phone == nil

    elsif @code == nil
      #Generer le code OTP
      @otp = Otp.find_by(num_phone: @num_phone)
      if @otp == nil
        @otp = Otp.new
      end
      @otp.num_phone = @num_phone
      @otp.code = Otp.generate_code
      #enregistrer le nouveau code otp
      @otp.save
      #Envoi du code OTP par SMS
      PaygateController.sms_alert("DOGANAM", @num_phone,
        "Utilisez ce code pour afficher votre historique de prets accordés:\n #{@otp.code}")
    else
      @otp = Otp.find_by num_phone: @num_phone, code: @code