app/controllers/pages_controller.rb

  def infodemandeur
    @demande = Demande.find_by(id: params[:id])
    @demandeur = Utilisateur.find_by(id: @demande.utilisateur_id)
---
SELECT  "utilisateurs".* FROM "utilisateurs" WHERE "utilisateurs"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]

  def acceptpret
    @demande = Demande.find_by(id: params[:id])
    if @demande.date_disbursed != nil
      redirect_to "/"
      return
    end
    @user = Utilisateur.find_by(id: @demande.utilisateur_id)
---
SELECT  "demandes".* FROM "demandes" WHERE "demandes"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
SELECT  "utilisateurs".* FROM "utilisateurs" WHERE "utilisateurs"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]

  def demandepret
    @error = ""
    if Utilisateur.pret_encours? current_user_id
      @error = "Cet utlisateur a déjà soumis une demande de prêt"
      puts @error
      redirect_to "/histopretssollicites"
      return
    else
      @categories = Category.all
      @deadlines = Deadline.all
      @user = Utilisateur.find_by(id: current_user_id)
---
SELECT "categories".* FROM "categories"
SELECT "deadlines".* FROM "deadlines"
SELECT  "utilisateurs".* FROM "utilisateurs" WHERE "utilisateurs"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]

  def demandepretvalider
    if Utilisateur.pret_encours? current_user_id
      @error = "Cet utlisateur a déjà soumis une demande de prêt"
      puts @error
      redirect_to "/histopretssollicites"
      return
    end

    dt_acc = 0.hour.from_now.localtime
    @user = Utilisateur.find_by(id: current_user_id)

    @demande = Demande.new(demande_params)
    @demande[:utilisateur_id] = current_user_id
    if @user.status.to_i == Utilisateur.status_active
      @demande[:date_accepted] = dt_acc
      @demande[:status] = Demande.status_en_attente_pret
      print "Etat en attente"
    else
      @demande[:date_accepted] = nil
      @demande[:status] = Demande.status_cpt_non_valide_nonexpire
      print "Etat non valide"
    end
    @demande[:penalty_amount] = @demande.taux * @demande.amount_borrowed
    @demande[:total_amount_paid] = 0

    if @demande.save
---
SELECT  "utilisateurs".* FROM "utilisateurs" WHERE "utilisateurs"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
INSERT INTO "demandes" ("utilisateur_id", "nombre_de_jour", "taux", "penalty_amount", "total_amount_paid", "is_anonymous", "amount_borrowed", "category_id", "phone", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def evolutiondemande
    @demande = Demande.order(id: :desc).where("utilisateur_id = #{current_user_id}").first

    @user = Utilisateur.find_by(id: current_user_id)
---
SELECT  "demandes".* FROM "demandes" WHERE (utilisateur_id = 16) ORDER BY "demandes"."id" DESC LIMIT ?  [["LIMIT", 1]]
SELECT  "utilisateurs".* FROM "utilisateurs" WHERE "utilisateurs"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]

  def rembourspret
    @demande = Demande.find_by(id: params[:id])
    @user = Utilisateur.find_by(id: current_user_id)
---
SELECT  "demandes".* FROM "demandes" WHERE "demandes"."id" = ? LIMIT ?  [["id", 17], ["LIMIT", 1]]
SELECT  "utilisateurs".* FROM "utilisateurs" WHERE "utilisateurs"."id" = ? LIMIT ?  [["id", 18], ["LIMIT", 1]]

def createcomptevalider
  puts params
  @user_exists = Utilisateur.find_by(phone: params[:phone])
  @error = ""

  if @user_exists != nil
    @error = "Un compte de même n° de téléphone exist déjà!"
    redirect_to "/createcompte"
    return
  end

  @user = Utilisateur.new(user_params)
  @user.status = Utilisateur.status_en_attente

  @user.id_document_url = Utilisateur.create_file_from_upload_data(
    params[:id_document_url],
    Utilisateur.user_img_dir
  )
  @user.photo_url = Utilisateur.create_file_from_upload_data(
    params[:photo_url],
    Utilisateur.user_img_dir
  )

  if @user.save
---
SELECT  "utilisateurs".* FROM "utilisateurs" WHERE "utilisateurs"."phone" = ? LIMIT ?  [["phone", "93708315"], ["LIMIT", 1]]
INSERT INTO "utilisateurs" ("nom", "prenoms", "age", "sexe", "quartier", "id_document_url", "photo_url", "password_digest", "phone", "pseudo", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

def corrigercompte
  @user = Utilisateur.find_by(id: session[:current_user_id])
---
SELECT  "utilisateurs".* FROM "utilisateurs" WHERE "utilisateurs"."id" = ? LIMIT ?  [["id", 23], ["LIMIT", 1]]

def corrigercomptevalider
  @user = Utilisateur.find_by(id: session[:current_user_id])
  if params[:id_document_url] != nil && params[:id_document_url] != ""
    params[:id_document_url] = Utilisateur.create_file_from_upload_data(
      params[:id_document_url],
      Utilisateur.user_img_dir
    )
  end
  if params[:photo_url] != nil && params[:photo_url] != ""
    params[:photo_url] = Utilisateur.create_file_from_upload_data(
      params[:photo_url],
      Utilisateur.user_img_dir
    )
  end

  if @user.update user_params
---
SELECT  "utilisateurs".* FROM "utilisateurs" WHERE "utilisateurs"."id" = ? LIMIT ?  [["id", 23], ["LIMIT", 1]]
UPDATE "utilisateurs" SET "id_document_url" = ?, "updated_at" = ? WHERE "utilisateurs"."id" = ?  [["id_document_url", "karaspiggies(m=e-yaaGqaa)(mh=mQLsLwVHml0nvHkr)original_565001422.jpg_77627..jpg"], ["updated_at", "2021-05-08 08:10:31.759985"], ["id", 16]]

def connexionvalider
  @user = Utilisateur.find_by(phone: params[:phone])
---
SELECT  "utilisateurs".* FROM "utilisateurs" WHERE "utilisateurs"."phone" = ? LIMIT ?  [["phone", "91367306"], ["LIMIT", 1]]