app/controllers/paygate_controller.rb

    def paygateaccepterpret
        #Enregistrement la transaction
        d = Demande.find_by(id: params[:id_demande])
        t = Transaction.new
        t.sender_phone = params[:phone]
        t.receiver_phone = d.phone
        t.amount = params[:amount]
        t.is_envoi = true
        t.demande_id = d.id
        if ! t.save
---
SELECT  "demandes".* FROM "demandes" WHERE "demandes"."id" = ? LIMIT ?  [["id", 17], ["LIMIT", 1]]
INSERT INTO "transactions" ("demande_id", "sender_phone", "receiver_phone", "is_envoi", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["demande_id", 17], ["sender_phone", "97936821"], ["receiver_phone", "97936820"], ["is_envoi", 1], ["created_at", "2021-06-28 12:20:19.982471"], ["updated_at", "2021-06-28 12:20:19.982471"]]

    def paygaterembourser
        #Enregistrement la transaction
        d = Demande.find_by(id: params[:id_demande])
        t = Transaction.new
        t.sender_phone = params[:phone]
        t.receiver_phone = d.phone
        t.amount = params[:amount]
        t.is_envoi = false
        t.demande_id = d.id
        if ! t.save
---
SELECT  "demandes".* FROM "demandes" WHERE "demandes"."id" = ? LIMIT ?  [["id", 17], ["LIMIT", 1]]
INSERT INTO "transactions" ("demande_id", "sender_phone", "receiver_phone", "amount", "is_envoi", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

    def envoi_argent(id_trans)
        trans = Transaction.find_by(id: id_trans)
        if trans == nil
            return
        end
        #appel API de remboursement
        pg_success = true #provisoirement

        if !pg_success
            return
        end
        trans.date_received = DateTime.now
        trans.taux_entree = Transaction::TAUX_ENT
        trans.taux_sortie = Transaction::TAUX_SORT
        trans.taux_preteur = Transaction::TAUX_PRET

        trans.save
---
SELECT  "transactions".* FROM "transactions" WHERE "transactions"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
UPDATE "transactions" SET "date_received" = ?, "taux_entree" = ?, "taux_sortie" = ?, "taux_preteur" = ?, "updated_at" = ? WHERE "transactions"."id" = ?  [["date_received", "2021-06-28 12:20:20.264299"], ["taux_entree", 0.03], ["taux_sortie", 0.0], ["taux_preteur", 0.33], ["updated_at", "2021-06-28 12:20:20.276243"], ["id", 16]]

    def finalisation_transaction (identifier, tx_reference, payment_reference)
        trans = Transaction.find_by(id: identifier)
        if trans == nil
            return
        end
        demande = Demande.find_by(id: trans.demande_id)
        if demande == nil
            return
        end
        #Modifier la ligne de transaction
        dt = DateTime.now
        trans.tx_reference = tx_reference
        trans.payment_reference = payment_reference
        date_envoi = dt
        trans.save
---
SELECT  "transactions".* FROM "transactions" WHERE "transactions"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
SELECT  "demandes".* FROM "demandes" WHERE "demandes"."id" = ? LIMIT ?  [["id", 17], ["LIMIT", 1]]
UPDATE "demandes" SET "total_amount_paid" = ?, "date_repaid" = ?, "status" = ?, "updated_at" = ? WHERE "demandes"."id" = ?  [["total_amount_paid", 6900], ["date_repaid", "2021-05-07 16:49:51.524463"], ["status", "18"], ["updated_at", "2021-05-07 16:49:51.800517"], ["id", 8]]
UPDATE "transactions" SET "tx_reference" = ?, "payment_reference" = ?, "updated_at" = ? WHERE "transactions"."id" = ?  [["tx_reference", "953"], ["payment_reference", "496"], ["updated_at", "2021-06-28 12:20:20.121350"], ["id", 16]]

            end
        end

        demande.save
---
UPDATE "demandes" SET "total_amount_paid" = ?, "date_repaid" = ?, "status" = ?, "updated_at" = ? WHERE "demandes"."id" = ?  [["total_amount_paid", 1100], ["date_repaid", "2021-06-28 12:22:53.210735"], ["status", "23"], ["updated_at", "2021-06-28 12:22:53.463478"], ["id", 17]]