app/models/demande.rb

    def self.nombre_quartier(the_params)
        dt_deb = the_params[:dt_deb]
        dt_fin = the_params[:dt_fin]
        cond_arr = []

        if !(dt_deb.nil? || dt_deb.empty?)
            cond_arr.push ["created_at >= ?", dt_deb]
        end
        if !(dt_fin.nil? || dt_fin.empty?)
            cond_arr.push ["created_at <= ?", dt_fin]
        end


        tout = Demande
        .joins(" INNER JOIN Utilisateurs U ON (U.id = Demandes.utilisateur_id)")
        .select ("count(DISTINCT quartier) as nbre")

        cond_arr.each do |one_cond|
            tout.where!(one_cond)
        end

        return tout.length > 0 ? tout[0]["nbre"] : 0;
---
SELECT count(DISTINCT quartier) as nbre FROM "demandes" INNER JOIN Utilisateurs U ON (U.id = Demandes.utilisateur_id)