app/models/utilisateur.rb

SELECT  "demandes".* FROM "demandes" WHERE (utilisateur_id = 16) ORDER BY "demandes"."created_at" DESC LIMIT ?  [["LIMIT", 1]]
---
    def self.pret_encours? (user_id)
        @demande = Demande.order("created_at": :desc).where("utilisateur_id = #{user_id}").first;